<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"35844acc020c3430d51ec70d17e546a66d2000c8843acea72e99a676a599ed02","plan_job_ref":"Job Test terraform-refresh #50 at https://github.com/dflook/terraform-github-actions/actions/runs/15425731196","plan_out_hash":"6af2407fe0cd61d386ed291adc8d7281136c83435c01d0d091be54914a39fd86","plan_hash":"457040ae15a0470c5520c8b2034c89073a16483a42ff81f50f3367d2b0d05ce1","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #50](https://github.com/dflook/terraform-github-actions/actions/runs/15425731196)